polls_app/app/models/response.rb

  def sibling_responses
    question.responses.where.not(id: self.id)
---
SELECT "responses".* FROM "responses" INNER JOIN "answer_choices" ON "responses"."answer_choice_id" = "answer_choices"."id" WHERE "answer_choices"."question_id" = $1 AND "responses"."id" IS NOT NULL  [["question_id", 1]]